# HTTP Methods
# GET - отримати дані з сервера
# Запит має лінк, можуть бути Path params і Query params

# POST - створити новий ресурс на сервері
# Запит має лінк, можуть бути Path params і Query params, а також тіло запиту (body)

# DELETE - видалити ресурс з сервера
# Запит має лінк, можуть бути Path params і Query params

# PUT - оновити ресурс на сервері (повністю)
# Запит має лінк, можуть бути Path params і Query params, а також тіло запиту (body)

# PATCH - оновити ресурс на сервері (частково)
# Запит має лінк, можуть бути Path params і Query params, а також тіло запиту (body)


# Each endpoint should be documented (use OpenAPI docs)


# Path params - {variable} якась змінна (зазвичай примітивного типу: str, int, bool ...). Дозволяє прокинути вхідні дані прямо в лінк
# GET api/v1/user/{user_id}
# api/v1/user/43befb02-f91b-489f-8345-d4d4fa65b72d  - дістає користувача з таким айді з бази даних
# Response example: {"id": "43befb02-f91b-489f-8345-d4d4fa65b72d", "name": "VlaDICK", "age" : 22, "is_married": false}

# Query params - ?variable=value&variable2=value2 - додаткові параметри запиту, які не є обов'язковими
# GET api/v1/user/?limit=10&offset=20
# Пагінація - спосіб розбити велику кількість даних на сторінки
# limit - скільки елементів повернути
# offset - з якого елемента починати повернення (для пагінації)

# Request body - дані, які ми відправляємо на сервер зазвичай у форматі JSON
# POST api/v1/user/ - створити нового користувача
# Request body example: {"name": "VlaDICK", "age" : 22, "is_married": false}
# Request body може бути як у POST, так і у PUT, PATCH методах

# HTTP Status Codes
# 200 OK - успішний запит, відповідь містить дані
# 201 Created - успішний запит, ресурс створено (наприклад, створення користувача, замовлення, тощо)
# 204 No Content - успішний запит, відповідь не містить даних (наприклад, після DELETE запиту або успішного оновлення ресурсу без повернення даних)
# 400 Bad Request - некоректний запит (наприклад, відсутність обов'язкових параметрів, неправильний формат даних)
# 422 Unprocessable Entity - викидає часто при валідації з Pydantic (наприклад, якщо тип даних не співпадає з очікуваним)
# 404 Not Found - ресурс не знайдено (наприклад, користувач з таким айді не існує)
# 418 I am a teapot - жартівливий статус код, використовується для тестування або як пасхалка
# !!!!500 Internal Server Error!!!!! - помилка на сервері (наприклад, помилка в коді, проблеми з базою даних) - не повинно бути в нормальних умовах (коли десь забули відловити помилку)